const Router = require('express')
const router = new Router()
const catalogController = require('../controller/catalog.controller')

//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// создание каталога

// передать методом пост, название title: 'catalog'
router.post('/catalog', catalogController.createCatalog)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
//
//
//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// получение списка каталогов
router.get('/catalog', catalogController.getCatalog)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
//
//
//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
//id title
// для изменения каталога нужно в 
//body{
//  id:1,
//  title:кроссовки
//}
router.put('/catalog', catalogController.updateCatalog)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
//
//
//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// для удаления елемента каталога нужно передать
//body{
//  id:1,
//  title:кроссовки
//}
router.delete('/catalog', catalogController.deleteCatalog)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
//
//
//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// == итоговый вариант

// parametr это элемент из списка каталога (элемент каталога) 

// получение списка товаров в каталоге с добавлением query параметров
// price='0-1000000'
// count=0
// gender='woman|girl|male|boy|unisex'
// size='41,42,43'
// page=1

router.get('/catalog/:id', catalogController.getCatalogProduct)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
//
//
//
module.exports = router