const Router = require('express')
const router = new Router()
const userController = require('../controller/user.controller')

//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// регистрация пользователя
// прокинуть в body.data={
//    firstname - имя пользователя
//    , lastname - фамилия пользователя
//    , age - возраст
//    , login - логин и проверка на уникальность
//    , email - почта в формате через qwerty@gmail.com
//    , password - пароль который ввели 2 раза без ошибки
//    , rule - должность на сайте
//}
router.post('/user', userController.createUser)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>




//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// получение одного пользователя
// после регистрации на client устанавливается cookie
// и при вызове этого метода cookie пересылаются и находится пользователь
router.get('/user', userController.getOneUser)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>




//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// получение всего списка пользователей
// требуется для получение в админки
router.get('/user/all', userController.getUser)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>




//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// обновление пользователя
// в body.data={
// id - пользователя
//, firstname - имя
//, lastname - фамилия
//, age - возраст
//, login - логин
//, email - email но лучше этого не делать
//, rule - права доступа
//, password - пароль
// }
router.put('/user', userController.updateUser)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>




//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>
// удаление пользователя
//  в body.data={
//  login
//, email
//}
router.delete('/user', userController.deleteUser)
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@>





module.exports = router